#Область ПрограммныйИнтерфейс

Функция ОписаниеКодаСтатусаПриемки(КодСтатуса) Экспорт
	ДопустимыеКодыСтатусов = дсфСтатусыДокументовЯндексМаркетПовтИсп.ДопустимыеКодыСтатусовПриемки();
	
	ОписаниеКодаСтатусаПриемки = Неопределено;
	Для Каждого ОписаниеКода Из ДопустимыеКодыСтатусов Цикл
		Если ОписаниеКода.Код = КодСтатуса Тогда
			ОписаниеКодаСтатусаПриемки = ОписаниеКода.Описание;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ОписаниеКодаСтатусаПриемки = Неопределено Тогда
		Возврат СтрШаблон("Для статуса приемки %1 описание не определено", КодСтатуса);	
		
	Иначе
		Возврат ОписаниеКодаСтатусаПриемки;
		
	КонецЕсли;
	
КонецФункции

// Функция - Код статуса приемки по статусу документа
//
// Параметры:
//  Статус	 - СправочникСсылка.СтатусыДокументов - Статус документа приемки
// 
// Возвращаемое значение:
//  КодСтатуса - Число
//
Функция КодСтатусаПриемкиПоСтатусуДокумента(Статус) Экспорт

	ДопустимыеКодыСтатусов = дсфСтатусыДокументовЯндексМаркетПовтИсп.ДопустимыеКодыСтатусовПриемки();
	
	КодПриемки = Неопределено;
	Для Каждого ОписаниеКода Из ДопустимыеКодыСтатусов Цикл
		Если ОписаниеКода.Статус = Статус Тогда
			КодПриемки = ОписаниеКода.Код;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если КодПриемки = Неопределено Тогда
		Возврат -1;
		
	Иначе
		Возврат КодПриемки;
		
	КонецЕсли;
	

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ОжидаемоеПоступлениеПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не Отказ Тогда 
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Источник.Ссылка);
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(МассивДокументов);

		ФоновыеПроцессы.ВыполнитьФоновоеЗадание("дсфСтатусыДокументовЯндексМаркет.СвязатьОжидаемыеПоступленияСЗаявкамиНаПриемку",
												МассивПараметров,,,
												НСтр("ru = 'Связать ожидаемые поступления с заявками на приемку'"));

	КонецЕсли;

КонецПроцедуры

Процедура СвязатьОжидаемыеПоступленияСЗаявкамиНаПриемку(ОжидаемыеПоступления) Экспорт
	РегистрыСведений.дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.СвязатьОжидаемыеПоступленияСЗаявкамиНаПриемку(ОжидаемыеПоступления);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти