#Область ПрограммныйИнтерфейс
Функция ЕдиницаИзмеренияШтук() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕдиницыИзмеренияШтук = Константы.дсфЕдиницаИзмеренияШтук.Получить();
	
	Если ЗначениеЗаполнено(ЕдиницыИзмеренияШтук) Тогда
		Возврат ЕдиницыИзмеренияШтук;
		
	Иначе
		ВызватьИсключение("Не заполнено значение константы 'Единица измерения штук'");
	
	КонецЕсли;
		
КонецФункции

Функция ЕдиницаИзмеренияКоробов() Экспорт
	
	ЕдиницыИзмеренияКоробов = Константы.дсфЕдиницаИзмеренияКоробов.Получить();
	
	Если ЗначениеЗаполнено(ЕдиницыИзмеренияКоробов) Тогда
		Возврат ЕдиницыИзмеренияКоробов;
		
	Иначе
		ВызватьИсключение("Не заполнено значение константы 'Единица измерения коробов'");

	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти