#Область ПрограммныйИнтерфейс
Функция НовыйРезультатОбработкиВходящегоЗапроса() Экспорт
	НовыйРезультатОбработки = Новый Структура;
	
	НовыйРезультатОбработки.Вставить("Данные", Неопределено); // объект xdto
	НовыйРезультатОбработки.Вставить("Ошибки", Новый Массив);
	
	Возврат НовыйРезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция РезультатОбработкиВходящегоЗапроса(ОбъектXdto, ТипЗапроса) Экспорт

	РезультатОбработки = НовыйРезультатОбработкиВходящегоЗапроса();
	
	Если ТипЗапроса = "putReferenceItems" Тогда
		// регистрация номенклатуры
		НоменклатураСписокXdto = ОбъектXdto.request["items"]["item"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьНоменклатуруЯндексМаркет(НоменклатураСписокXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "putInbound" Тогда
		// заявка на поступление
		ДанныеЗаявкиXdto = ОбъектXdto.request["inbound"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьЗаявкуНаПриемкуЯндексМаркет(ДанныеЗаявкиXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "putInboundRegistry" Тогда
		// реестр поступления, создание документа ПланПоступления
		ДанныеРеестраXdto = ОбъектXdto.request["registry"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьРеестрПриемкиЯндексМаркет(ДанныеРеестраXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getInbound" Тогда
		// детали приемки
		ИдентификаторыОтгрузкиXdto = ОбъектXdto.request["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОДеталяхПриемки(ИдентификаторыОтгрузкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getInboundStatus" Тогда
		// статус приемки, вариант 1
		ДанныеОПриемкахXdto = ОбъектXdto.request["inboundsId"]["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОСтатусахЗаявокНаПриемку(ДанныеОПриемкахXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "getInboundsStatus" Тогда
		// статус приемки, вариант 2
		ДанныеОПриемкахXdto = ОбъектXdto.request["inboundsId"]["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОСтатусахЗаявокНаПриемкуВариант2(ДанныеОПриемкахXdto,
																						РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getInboundStatusHistory" Тогда
		// история статусов приемок, вариант 1
		ДанныеОбОтгрузкахXdto = ОбъектXdto.request["inboundIds"]["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьИсториюСтатусовЗаявокНаПриемку(ДанныеОбОтгрузкахXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "getInboundHistory" Тогда
		// история статусов приемок, вариант 2
		ДанныеПриемкиXdto = ОбъектXdto.request["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьИсториюСтатусовЗаявкиНаПриемкуВариант2(ДанныеПриемкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "putOutbound" Тогда
		// регистрация / обновление заявки на отгрузку
		ДанныеЗаявкиXdto = ОбъектXdto.request["outbound"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьЗаявкуНаОтгрузкуЯндексМаркет(ДанныеЗаявкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "putOutboundRegistry" Тогда
		// реестр отправки, создание документа ПланПоступления
		ДанныеРеестраXdto = ОбъектXdto.request["registry"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьРеестрОтгрузкиЯндексМаркет(ДанныеРеестраXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutboundStatus" Тогда
		// статус отгрузок, вариант 1
		ДанныеОбОтгрузкахXdto = ОбъектXdto.request["outboundIds"]["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОСтатусахЗаявокНаОтгрузку(ДанныеОбОтгрузкахXdto,
																					РезультатОбработки);
	
	ИначеЕсли ТипЗапроса = "getOutboundsStatus" Тогда
		// статус отгрузок, вариант 2
		ДанныеОбОтгрузкахXdto = ОбъектXdto.request["outboundsId"]["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОСтатусахЗаявокНаОтгрузкуВариант2(ДанныеОбОтгрузкахXdto,
																							РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutbound" Тогда
		// детали приемки
		ИдентификаторыОтгрузкиXdto = ОбъектXdto.request["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОДеталяхОтгрузки(ИдентификаторыОтгрузкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutboundStatusHistory" Тогда
		// история статусов отгрузок, вариант 1
		ДанныеОбОтгрузкахXdto = ОбъектXdto.request["outboundIds"]["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьИсториюСтатусовЗаявокНаОтгрузку(ДанныеОбОтгрузкахXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutboundHistory" Тогда
		// история статусов отгрузок, вариант 2
		ДанныеОтгрузкиXdto = ОбъектXdto.request["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьИсториюСтатусовЗаявкиНаОтгрузкуВариант2(ДанныеОтгрузкиXdto,
																						РезультатОбработки);
	
	ИначеЕсли ТипЗапроса = "getStocks" Тогда
		// остатки товаров
		
		// отборы
		КоличествоЗаписей = ОбъектXdto.request["limit"];
		Смещение = ОбъектXdto.request["offset"];
		ОтборПоТоварам = ОбъектXdto.request["unitIds"];

		дсфМенеджерДанныхЯндексМаркет.ПодготовитьДанныеПоОстаткамТоваров(РезультатОбработки,
																КоличествоЗаписей,
																Смещение,
																ОтборПоТоварам);

	Иначе
		ТекстИсключения = СтрШаблон("Необрабатываемый тип запроса [type] %1", ТипЗапроса);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;

	Возврат РезультатОбработки;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти