#Область ПрограммныйИнтерфейс
Функция НовыйРезультатОбработкиВходящегоЗапроса() Экспорт
	НовыйРезультатОбработки = Новый Структура;
	
	НовыйРезультатОбработки.Вставить("Данные", Неопределено); // объект xdto
	НовыйРезультатОбработки.Вставить("Ошибки", Новый Массив);
	
	Возврат НовыйРезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция РезультатОбработкиВходящегоЗапроса(ОбъектXdto, ТипЗапроса) Экспорт

	РезультатОбработки = НовыйРезультатОбработкиВходящегоЗапроса();
	
	Если ТипЗапроса = "putReferenceItems" Тогда
		// регистрация номенклатуры
		НоменклатураСписокXdto = ОбъектXdto.request["items"]["item"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьНоменклатуруЯндексМаркет(НоменклатураСписокXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "putInbound" Тогда
		// заявка на поступление
		ДанныеЗаявкиXdto = ОбъектXdto.request["inbound"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьЗаявкуНаПриемкуЯндексМаркет(ДанныеЗаявкиXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "putInboundRegistry" Тогда
		// реестр поступления, создание документа ПланПоступления
		ДанныеРеестраXdto = ОбъектXdto.request["registry"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьРеестрПриемкиЯндексМаркет(ДанныеРеестраXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getInboundsStatus" Тогда
		// статус приемок
		ДанныеОПриемкахXdto = ОбъектXdto.request["inboundsId"]["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОСтатусахЗаявокНаПриемку(ДанныеОПриемкахXdto, РезультатОбработки);

	ИначеЕсли ТипЗапроса = "getInbound" Тогда
		// детали приемки
		ИдентификаторыОтгрузкиXdto = ОбъектXdto.request["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОДеталяхПриемки(ИдентификаторыОтгрузкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getInboundHistory" Тогда
		// история статусов приемок
		ДанныеПриемкиXdto = ОбъектXdto.request["inboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьИсториюСтатусовЗаявкиНаПриемку(ДанныеПриемкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "putOutbound" Тогда
		// история статусов приемок
		ДанныеЗаявкиXdto = ОбъектXdto.request["outbound"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьЗаявкуНаОтгрузкуЯндексМаркет(ДанныеЗаявкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "putOutboundRegistry" Тогда
		// реестр отправки, создание документа ПланПоступления
		ДанныеРеестраXdto = ОбъектXdto.request["registry"];
		дсфМенеджерДанныхЯндексМаркет.СоздатьОбновитьРеестрОтгрузкиЯндексМаркет(ДанныеРеестраXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutboundsStatus" Тогда
		// статус отгрузок
		ДанныеОбОтгрузкахXdto = ОбъектXdto.request["outboundsId"]["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОСтатусахЗаявокНаОтгрузку(ДанныеОбОтгрузкахXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutbound" Тогда
		// детали приемки
		ИдентификаторыОтгрузкиXdto = ОбъектXdto.request["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьСведенияОДеталяхОтгрузки(ИдентификаторыОтгрузкиXdto, РезультатОбработки);
		
	ИначеЕсли ТипЗапроса = "getOutboundHistory" Тогда
		// история статусов отгрузок
		ДанныеПриемкиXdto = ОбъектXdto.request["outboundId"];
		дсфМенеджерДанныхЯндексМаркет.ПодготовитьИсториюСтатусовЗаявкиНаОтгрузку(ДанныеПриемкиXdto, РезультатОбработки);
	
	ИначеЕсли ТипЗапроса = "getStocks" Тогда
		// остатки товаров
		
		// отборы
		КоличествоЗаписей = ОбъектXdto.request["limit"];
		Смещение = ОбъектXdto.request["offset"];
		ОтборПоТоварам = ОбъектXdto.request["unitIds"];

		дсфМенеджерДанныхЯндексМаркет.ПодготовитьДанныеПоОстаткамТоваров(РезультатОбработки,
																КоличествоЗаписей,
																Смещение,
																ОтборПоТоварам);

	Иначе
		ВызватьИсключение "Необрабатываемый тип запроса [type]";
		
	КонецЕсли;

	Возврат РезультатОбработки;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти