#Область ПрограммныйИнтерфейс
#Область ПодсистемаБазоваяФункциональность

// Обновляет интерфейс программы сохраняя текущее активное окно.
//
Процедура ОбновитьИнтерфейсПрограммы() Экспорт
	Если ВерсияБСП() >= 22500 Тогда
		// Подсистема СтандартныеПодсистемы.БазоваяФункциональность 
		Если дсфОбщегоНазначенияВызовСервераПовтИсп.ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность") Тогда
			ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияКлиент");
			ОбщийМодуль.ОбновитьИнтерфейсПрограммы();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Функция возвращает установленную версию Библиотеки стандартных подсистем
// 
// Возвращаемое значение:
//  Число 
//
Функция ВерсияБСП()
	Возврат дсфОбщегоНазначенияВызовСервераПовтИсп.ВерсияБСП();
КонецФункции

#КонецОбласти