#Область ПрограммныйИнтерфейс
Функция ТокенАвторизацииДляВходящихЗапросов() Экспорт
	Возврат дсфЗащищенныеФункцииВызовСервера.ТокенАвторизацииДляВходящихЗапросов();
	
КонецФункции 

Процедура ЗаписатьТокенАвторизацииДляВходящихЗапросов(Токен) Экспорт
	
	дсфЗащищенныеФункцииВызовСервера.ЗаписатьТокенАвторизацииДляВходящихЗапросов(Токен);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти