
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФормаЗаписиПриСозданииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ФормаЗаписиПриСозданииНаСервере()

	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");

	ПрочитанныеДанныеРеестра = ЗаписьОбъект.ДанныеРеестра.Получить();

	ТекстРеестрВходящиеДанные = ПрочитанныеДанныеРеестра;
	
КонецПроцедуры

#КонецОбласти
