#Область ОбработчикиСобытий
Функция HealthGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция GoodsPOST(Запрос)
	ИмяПравила = дсфПравилаОбработкиВходящихЗапросовАпи.ИмяПравилаРегистрацииНовойНоменклатуры();
	Возврат аргмВходящиеЗапросыА1.ОтветНаВходящийЗапрос(Запрос, ИмяПравила);
	
КонецФункции

Функция PartnersPOST(Запрос)
	ИмяПравила = дсфПравилаОбработкиВходящихЗапросовАпи.ИмяПравилаРегистрацииНовогоКонтрагента();
	Возврат аргмВходящиеЗапросыА1.ОтветНаВходящийЗапрос(Запрос, ИмяПравила);

КонецФункции

Функция PartnerChangesPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИдКонтрагента = Запрос.ПараметрыURL.Получить("partner-id");
	
	Ответ.УстановитьТелоИзСтроки(СтрШаблон("PUT ОК: %1", ИдКонтрагента));
	
	Возврат Ответ;

КонецФункции

Функция InboundOrdersPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OutboundOrdersPOST(Запрос)
	ИмяПравила = дсфПравилаОбработкиВходящихЗапросовАпи.ИмяПравилаРегистрацииНовогоПланаОтгрузки();
	Возврат аргмВходящиеЗапросыА1.ОтветНаВходящийЗапрос(Запрос, ИмяПравила);

КонецФункции

#КонецОбласти
