
&ИзменениеИКонтроль("МассивОбщихСвойствДляСвязанных")
Функция дсфМассивОбщихСвойствДляСвязанных()

	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("Масса");
	МассивСвойств.Добавить("МассаНетто");
	МассивСвойств.Добавить("Объем");
	МассивСвойств.Добавить("ОбъемНетто");
	МассивСвойств.Добавить("СрокХранения");
	МассивСвойств.Добавить("Артикул");
	МассивСвойств.Добавить("ВидНоменклатуры");
	МассивСвойств.Добавить("ЕдиницаИзмерения");
	МассивСвойств.Добавить("ЕдиницаИзмеренияСрокаХранения");
	МассивСвойств.Добавить("НаименованиеEn");
	МассивСвойств.Добавить("Наименование");
	МассивСвойств.Добавить("НаименованиеПолное");
	МассивСвойств.Добавить("ТорговаяМарка");
	МассивСвойств.Добавить("ЯвляетсяКомплектом");
	МассивСвойств.Добавить("Цена");
	МассивСвойств.Добавить("Родитель");
	МассивСвойств.Добавить("НаборУпаковок");
	МассивСвойств.Добавить("Организация");
	МассивСвойств.Добавить("URLИзображения");
#Вставка
	МассивСвойств.Добавить("дсфАртикулПолный");
#КонецВставки
	Возврат МассивСвойств;

КонецФункции
