#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
Функция HealthGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
	
Функция SendDataPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос);
	
КонецФункции

Функция putInboundPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "putInbound");

КонецФункции

Функция putInboundRegistryPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "putInboundRegistry");

КонецФункции

// Функция - Получение статуса приемки
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция getInboundStatusPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getInboundStatus");

КонецФункции

Функция getInboundsStatusPOST_v2(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getInboundsStatus");

КонецФункции

// Функция - История статусов приемки
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция getInboundStatusHistoryPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getInboundStatusHistory");
	
КонецФункции

Функция getInboundHistoryPOST_v2(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getInboundHistory");

КонецФункции

// Функция - Получение результата, деталей приёмки
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция getInboundPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getInbound");

КонецФункции

// Функция - Получение остатков товаров
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция getStocksPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getStocks");
	
КонецФункции

Функция putOutboundPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "putOutbound");

КонецФункции

Функция putOutboundRegistryPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "putOutboundRegistry");

КонецФункции

Функция getOutboundStatusPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getOutboundStatus");

КонецФункции

Функция getOutboundsStatusPOST_v2(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getOutboundsStatus");

КонецФункции

Функция getOutboundStatusHistoryPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getOutboundStatusHistory");

КонецФункции

Функция getOutboundHistoryPOST_v2(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getOutboundHistory");

КонецФункции

Функция getOutboundPOST(Запрос)
	Возврат дсфВходящиеЗапросыЯндексМаркет.HttpОтветНаВходящийЗапрос(Запрос, "getOutbound");

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
