#Область ПрограммныйИнтерфейс 

Функция ИмяПравилаРегистрацииНовойНоменклатуры() Экспорт
	Возврат "РегистрацияНовыхПозицийНоменклатуры";
	
КонецФункции

//Функция ИмяПравилаОбновленияОтчетаОПродажах() Экспорт
//	Возврат "ОбновлениеЕжедневногоОтчетаОПродажах";
//	
//КонецФункции

//Функция ИмяПравилаОбновленияДокументовВозвратаДС() Экспорт
//	Возврат "ОбновлениеДокументовВозвратаДС";
//	
//КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ЗаполнитьДоступныеПравилаОбработки(ПравилаОбработки) Экспорт
	
	ПравилаОбработки.Вставить(ИмяПравилаРегистрацииНовойНоменклатуры(),
								ПравилоРегистрацииНовойНоменклатурыСлужебноеОписание());
	//							
	//ПравилаОбработки.Вставить(ИмяПравилаОбновленияОтчетаОПродажах(),
	//							ПравилоОбновлениеОтчетаОПродажахСлужебноеОписание());
	//							
	//ПравилаОбработки.Вставить(ИмяПравилаОбновленияДокументовВозвратаДС(),
	//							ПравилоОбновлениеВозвратовДССлужебноеОписание());
							
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПравилоРегистрацииНовойНоменклатурыСлужебноеОписание()
	ИмяПравила = ИмяПравилаРегистрацииНовойНоменклатуры();
	
	ПравилоОбработки = аргмПравилаОбработкиВходящихЗапросовA1.НовоеПравилоОбработкиВходящихЗапросов(ИмяПравила);
	
	ПравилоОбработки["ИмяМетода"] = "дсфОбработкаВходящихЗапросовАпи.РегистрацияНовыхПозицийНоменклатуры";
	ПравилоОбработки["ПроверятьНаличиеТелаЗапроса"] = Истина;
	
	ПравилоОбработки["ПроверятьИдемпотентность"] = Истина;
	ПравилоОбработки.Вставить("ТипЗапроса", "postGoods");
	ПравилоОбработки.Вставить("ПроверятьНаличиеКлючаАпи", Истина);
	
	Возврат ПравилоОбработки;
	
КонецФункции

//Функция ПравилоОбновлениеОтчетаОПродажахСлужебноеОписание()
//	ИмяПравила = ИмяПравилаОбновленияОтчетаОПродажах();
//	
//	ПравилоОбработки = аргмПравилаОбработкиВходящихЗапросовA1.НовоеПравилоОбработкиВходящихЗапросов(ИмяПравила);
//	
//	ПравилоОбработки["ИмяМетода"] = "аргмОбработкаВходящихЗапросовАйна.ОбновлениеДокументовПоЕжедневномуОтчету";
//	ПравилоОбработки["ПроверятьНаличиеТелаЗапроса"] = Истина;
//	
//	ИменаСвойствСоЗначениямиДата = Новый Массив; 
//	ИменаСвойствСоЗначениямиДата.Добавить("date");
//	ИменаСвойствСоЗначениямиДата.Добавить("order_date");
//	
//	ПравилоОбработки["ИменаСвойствСоЗначениямиДата"] = ИменаСвойствСоЗначениямиДата;
//	
//	ПравилоОбработки["ПроверятьИдемпотентность"] = Истина;
//	
//	Возврат ПравилоОбработки;
//	
//КонецФункции

//Функция ПравилоОбновлениеВозвратовДССлужебноеОписание()
//	ИмяПравила = ИмяПравилаОбновленияДокументовВозвратаДС();
//	
//	ПравилоОбработки = аргмПравилаОбработкиВходящихЗапросовA1.НовоеПравилоОбработкиВходящихЗапросов(ИмяПравила);
//	
//	ПравилоОбработки["ИмяМетода"] = "аргмОбработкаВходящихЗапросовАйна.ОбновлениеДокументовВозвратаДС";
//	ПравилоОбработки["ПроверятьНаличиеТелаЗапроса"] = Истина;
//	
//	ИменаСвойствСоЗначениямиДата = Новый Массив; 
//	ИменаСвойствСоЗначениямиДата.Добавить("date");
//	ИменаСвойствСоЗначениямиДата.Добавить("order_date");
//	ИменаСвойствСоЗначениямиДата.Добавить("primary_receipt_date");
//	
//	ПравилоОбработки["ИменаСвойствСоЗначениямиДата"] = ИменаСвойствСоЗначениямиДата;
//	
//	ПравилоОбработки["ПроверятьИдемпотентность"] = Истина;
//	
//	Возврат ПравилоОбработки;
//	
//КонецФункции

#КонецОбласти