
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИдентификаторЗаявкиВходящий = 
			РегистрыСведений.дсфИдентификаторыЯндексМаркет.ПубличныйИдентификаторПоСсылкеОбъекта(Объект.Ссылка);
		
	КонецЕсли;
		
	ПриСозданииПриЧтенииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);
	Если ЭтоНовый Тогда
		СсылкаОтбора = Документы.дсфЗаявкаНаОтгрузку.ПолучитьСсылку();
	Иначе
		СсылкаОтбора = Объект.Ссылка;
	КонецЕсли; 
	
	СлужебныйКлиентСервер.НайтиДобавитьЭлементОтбораКомпоновки(ВерсииРеестров.Отбор, "ЗаявкаНаОтгрузку", СсылкаОтбора);
	
КонецПроцедуры


#КонецОбласти
