
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму(
		"Обработка.дсфПанельАдминистрирования.Форма.РазделНастройкиВзаимодействия",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.дсфПанельАдминистрирования.Форма.РазделНастройкиВзаимодействия" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
