#Область ОбработчикиСобытийФормы
&НаСервере
Процедура дсфПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	дсфДействияПриСозданииФормыЭлемента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура дсфДействияПриСозданииФормыЭлемента()
	
	ГруппаДляРазмещенияРеквизитов = "ГруппаОсновные";
	ИмяСледующегоЭлементаФормы = "ЕдиницаИзмерения";

	// Артикул (полный)
	Если ЭтаФорма.Элементы.Найти(ИмяСледующегоЭлементаФормы) = Неопределено Тогда
		дсфАртикулПолный = ЭтаФорма.Элементы.Добавить("дсфАртикулПолный",
													Тип("ПолеФормы"),
													ЭтаФорма.Элементы[ГруппаДляРазмещенияРеквизитов]);
	
	Иначе
		дсфАртикулПолный = ЭтаФорма.Элементы.Вставить("дсфАртикулПолный",
													Тип("ПолеФормы"),
													ЭтаФорма.Элементы[ГруппаДляРазмещенияРеквизитов],
													ЭтаФорма.Элементы[ИмяСледующегоЭлементаФормы]);
	
	КонецЕсли;
	
	дсфАртикулПолный.Вид = ВидПоляФормы.ПолеВвода;
	дсфАртикулПолный.ПутьКДанным = "Объект.дсфАртикулПолный";
	дсфАртикулПолный.Заголовок = "Артикул (полный)";
	дсфАртикулПолный.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	дсфАртикулПолный.ТолькоПросмотр = Ложь; 
	дсфАртикулПолный.АвтоМаксимальнаяШирина = Истина;
	дсфАртикулПолный.Ширина = 30;
	дсфАртикулПолный.МаксимальнаяШирина = 69;

КонецПроцедуры

#КонецОбласти



