#Область ПрограммныйИнтерфейс

Функция ДопустимыеКодыСтатусовПриемки() Экспорт
	ДопустимыеКоды = Новый Массив;
	
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(-1, Справочники.СтатусыДокументов.ПустаяСсылка(), "Статус не определен"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 0, Справочники.СтатусыДокументов.НеЗагружен, "Партнерский склад не принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 0, Справочники.СтатусыДокументов.Аннулирован, "Партнерский склад не принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.Новый, "Партнерский склад принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.Подтвержден, "Партнерский склад принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(20, Справочники.СтатусыДокументов.КВыполнению, "Товары или заказы прибыли на партнерский склад"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(30, Справочники.СтатусыДокументов.ВРаботе, "Товары или заказы принимаются на партнерском складе"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(30, Справочники.СтатусыДокументов.НеПересчитан, "Товары или заказы принимаются на партнерском складе"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(40, Справочники.СтатусыДокументов.Завершен, "Товары или заказы приняты на партнерский склад"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(40, Справочники.СтатусыДокументов.Принят, "Товары или заказы приняты на партнерский склад"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(50, Справочники.СтатусыДокументов.ПустаяСсылка(), "Товары или заказы отгружены с транзитного склада и доставляются на партнерский склад"));

	Возврат Новый ФиксированныйМассив(ДопустимыеКоды);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НовыйКодСтатуса(Код, Статус, Описание)

	Возврат Новый Структура("Код, Статус, Описание", Код, Статус, Описание);

КонецФункции

#КонецОбласти