#Область ПрограммныйИнтерфейс

Функция ДопустимыеКодыСтатусовПриемки() Экспорт
	ДопустимыеКоды = Новый Массив;
	
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(-1, Справочники.СтатусыДокументов.ПустаяСсылка(), "Статус не определен"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 0, Справочники.СтатусыДокументов.НеЗагружен, "Партнерский склад не принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 0, Справочники.СтатусыДокументов.Аннулирован, "Партнерский склад не принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.Новый, "Партнерский склад принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.Подтвержден, "Партнерский склад принял заявку на приемку от Маркета"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(20, Справочники.СтатусыДокументов.КВыполнению, "Товары или заказы прибыли на партнерский склад"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(30, Справочники.СтатусыДокументов.ВРаботе, "Товары или заказы принимаются на партнерском складе"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(30, Справочники.СтатусыДокументов.НеПересчитан, "Товары или заказы принимаются на партнерском складе"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(40, Справочники.СтатусыДокументов.Завершен, "Товары или заказы приняты на партнерский склад"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(40, Справочники.СтатусыДокументов.Принят, "Товары или заказы приняты на партнерский склад"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(50, Справочники.СтатусыДокументов.ПустаяСсылка(), "Товары или заказы отгружены с транзитного склада и доставляются на партнерский склад"));

	Возврат Новый ФиксированныйМассив(ДопустимыеКоды);

КонецФункции

Функция ДопустимыеКодыСтатусовОтгрузки() Экспорт
	ДопустимыеКоды = Новый Массив;
	
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(-1, Справочники.СтатусыДокументов.ПустаяСсылка(), "Статус не определен"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(0, Справочники.СтатусыДокументов.НеЗагружен, "Заявка на отправку создана и ожидат подтверждения"));
	
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.Новый, "Заявка на отправку создана и подтверждена в системе партнерского склада"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.Подтвержден, "Заявка на отправку создана и подтверждена в системе партнерского склада"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 1, Справочники.СтатусыДокументов.КВыполнению, "Заявка на отправку создана и подтверждена в системе партнерского склада"));
	
	// уточнить возможность отнесения готового у отбору к коду 310
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(1, Справочники.СтатусыДокументов.ГотовКОтбору, "Заявка на отправку создана и подтверждена в системе партнерского склада"));

	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 4, Справочники.СтатусыДокументов.Аннулирован, "Партнер отменил заявку на перемещение в системе партнера-перевозчика"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса( 4, Справочники.СтатусыДокументов.Отменен, "Партнер отменил заявку на перемещение в системе партнера-перевозчика"));

	ДопустимыеКоды.Добавить(НовыйКодСтатуса(310, Справочники.СтатусыДокументов.ВОтбор, "Товары или заказы собираются для передачи"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(310, Справочники.СтатусыДокументов.ВОтборе, "Товары или заказы собираются для передачи"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(310, Справочники.СтатусыДокументов.Отобран, "Товары или заказы собираются для передачи"));
	
	// Временно документ в статусе ГотовКОтгрузке должен возвращать код 330, а не 320
//	ДопустимыеКоды.Добавить(НовыйКодСтатуса(320, Справочники.СтатусыДокументов.ГотовКОтгрузке, "Товары или заказы собраны для передачи"));

	ДопустимыеКоды.Добавить(НовыйКодСтатуса(330, Справочники.СтатусыДокументов.ГотовКОтгрузке, "Товары или заказы переданы курьеру полностью"));
	ДопустимыеКоды.Добавить(НовыйКодСтатуса(330, Справочники.СтатусыДокументов.Отгружен, "Товары или заказы переданы курьеру полностью"));
	
	//
	// TODO: описать правила для определения частичной отгрузки и возврата кода 325
	//
	
	Возврат Новый ФиксированныйМассив(ДопустимыеКоды);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НовыйКодСтатуса(Код, Статус, Описание)

	Возврат Новый Структура("Код, Статус, Описание", Код, Статус, Описание);

КонецФункции

#КонецОбласти