#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция КлючАпиЗарегистрирован(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	дсфНастройкиДоступаКАпи.КлючАпи КАК КлючАпи
	|ИЗ
	|	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	|ГДЕ
	|	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция КлиентПоКлючуАпи(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	дсфНастройкиДоступаКАпи.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	|ГДЕ
	|	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Клиент;
		
	КонецЦикла;
		
	Возврат Неопределено;
	
КонецФункции

Функция ПрефиксКлиентаПоКлючуАпи(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфНастройкиДоступаКАпи.Префикс КАК Префикс
	               |ИЗ
	               |	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	               |ГДЕ
	               |	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Префикс;
		
	КонецЦикла;
		
	Возврат "";
	
КонецФункции

Функция ГруппаДляНоменклатурыКлиентаПоКлючуАпи(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфНастройкиДоступаКАпи.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	               |ГДЕ
	               |	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ГруппаНоменклатуры;
		
	КонецЦикла;
		
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

Функция ЗначениеНастроекКлиента(Знач КлючАпи) Экспорт
	
	ЗначенияНастроек = Новый Структура;
	ЗначенияНастроек.Вставить("Клиент", Неопределено);
	ЗначенияНастроек.Вставить("КлючАпи", "");
	ЗначенияНастроек.Вставить("Префикс", "");
	ЗначенияНастроек.Вставить("Пользователь", Неопределено);
	ЗначенияНастроек.Вставить("ГруппаНоменклатуры", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфНастройкиДоступаКАпи.КлючАпи КАК КлючАпи,
	               |	дсфНастройкиДоступаКАпи.Клиент КАК Клиент,
	               |	дсфНастройкиДоступаКАпи.Префикс КАК Префикс,
	               |	дсфНастройкиДоступаКАпи.Пользователь КАК Пользователь,
	               |	дсфНастройкиДоступаКАпи.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	               |ГДЕ
	               |	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЗначенияНастроек, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЗначенияНастроек;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
	
#КонецЕсли
